InformationRegisters/ЗаданияОбменаСGoogle.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияОбменаСGoogle</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбластьДоступа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбластиДоступаGoogle</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ОбластиДоступаGoogle.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ОбластиДоступаGoogle</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Профиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Календарь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контакты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ЗаданияОбменаСGoogle/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ВключитьПоОбластиДоступа(ОбластьДоступа) Экспорт
	
	РегламентноеЗадание = РегламентноеЗаданиеМетаданные(ОбластьДоступа);
	Если РегламентноеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ОбластьДоступа = ОбластьДоступа;
	МенеджерЗаписи.Прочитать();
	
	Если ЗначениеЗаполнено(МенеджерЗаписи.Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
		Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(РегламентноеЗадание);
		Задание.Использование = Истина;
		Задание.Ключ = Строка(Новый УникальныйИдентификатор);
		Задание.Наименование = РегламентноеЗадание;
		Задание.Расписание = Расписание(РегламентноеЗадание);
		Задание.Записать();
		
		МенеджерЗаписи.Идентификатор = Задание.УникальныйИдентификатор;
		
	МенеджерЗаписи.ОбластьДоступа = ОбластьДоступа;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция РегламентноеЗадание(ОбластьДоступа) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаданияОбменаСGoogle.Идентификатор
	|ИЗ
	|	РегистрСведений.ЗаданияОбменаСGoogle КАК ЗаданияОбменаСGoogle
	|ГДЕ
	|	ЗаданияОбменаСGoogle.ОбластьДоступа = &ОбластьДоступа");
	Запрос.УстановитьПараметр("ОбластьДоступа", ОбластьДоступа);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Выборка.Идентификатор);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РегламентноеЗаданиеМетаданные(ОбластьДоступа)
	
	Если ОбластьДоступа = Перечисления.ОбластиДоступаGoogle.Календарь Тогда
		Возврат Метаданные.РегламентныеЗадания.СинхронизацияGoogleCalendar;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция Расписание(РегламентноеЗадание)
	
	Результат = Новый РасписаниеРегламентногоЗадания;
	
	Результат.ПериодПовтораДней = 1;
	
	Если РегламентноеЗадание = Метаданные.РегламентныеЗадания.СинхронизацияGoogleCalendar Тогда
		Результат.ПериодПовтораВТечениеДня = 300;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
